[
        {
            "js": {
                "description": "<p>Lvl. 1 – Alapfokú ismeretek<br />🔹 Ismerem az alapvető szintaxist (változók, ciklusok, függvények).<br />🔹 Tudok egyszerű JavaScript kódokat írni és futtatni böngészőben vagy Node.js-ben.<br />🔹 Értem az alapvető adattípusokat és vezérlési szerkezeteket.<br />🔹 Képes vagyok egyszerű interaktív elemeket létrehozni HTML/CSS segítségével.</p><p>Lvl. 2 – Kezdő fejlesztő<br />🔹 Tudok DOM-elemeket manipulálni és eseménykezelőket használni.<br />🔹 Alapvető ismereteim vannak az aszinkron JavaScript működéséről (pl. setTimeout, fetch).<br />🔹 Tudok egyszerű webes alkalmazásokat készíteni, például űrlapokat validálni.<br />🔹 Ismerem az alapszintű hibakeresési technikákat (console.log, böngésző fejlesztői eszközök).</p><p>Lvl. 3 – Középhaladó fejlesztő<br />🔹 Magabiztosan kezelem az ES6+ funkciókat (arrow function, destructuring, spread/rest operátor).<br />🔹 Tudok aszinkron kódot írni async/await és Promise használatával.<br />🔹 Ismerem az OOP és a funkcionális programozás alapjait JavaScriptben.<br />🔹 Tudok egyszerűbb frontend frameworkökkel dolgozni (pl. alap React, Vue, vagy Livewire).<br />🔹 Képes vagyok API-kat használni és alapvető CRUD műveleteket végezni.</p><p>Lvl. 4 – Haladó fejlesztő<br />🔹 Magabiztosan kezelek komplex JavaScript kódokat és struktúrákat.<br />🔹 Ismerem a design patternöket és alkalmazni is tudom őket.<br />🔹 Mélyebb ismereteim vannak a modern frontend frameworkökről (React, Vue, Angular).<br />🔹 Tudok optimalizált és jól strukturált kódot írni.<br />🔹 Ismerem a build toolokat (Webpack, Vite, esbuild) és a kódfordítási folyamatokat.<br />🔹 Képes vagyok saját NPM csomagokat készíteni és publikálni.</p><p>Lvl. 5 – Profi fejlesztő<br />🔹 Mélyreható ismereteim vannak a JavaScript működéséről (hoisting, closure, event loop, prototípuslánc).<br />🔹 Ismerem a teljes frontend és backend ökoszisztémát JavaScript alapon (Node.js, Express, SSR, CSR).<br />🔹 Optimalizált, jól tesztelhető, karbantartható és skálázható kódot írok.<br />🔹 Képes vagyok komplex alkalmazásokat fejleszteni és architektúrát tervezni.<br />🔹 Tapasztalattal rendelkezem teljesítményoptimalizálásban és memóriakezelésben.<br />🔹 Aktívan követem a JavaScript fejlesztéseit és hozzájárulok nyílt forráskódú projektekhez.</p>"
            } 
        },
        {
            "php": {
                "description": "<p>Lvl. 1 – Alapfokú ismeretek<br />🔹 Ismerem a PHP alapvető szintaxisát (változók, függvények, ciklusok, feltételek).<br />🔹 Tudok egyszerű PHP fájlokat létrehozni és futtatni.<br />🔹 Értem a PHP és HTML kapcsolatát, tudok egyszerű dinamikus tartalmakat generálni.<br />🔹 Ismerem az alapvető szuperglobális változókat ($_GET, $_POST, $_SESSION).</p><p>Lvl. 2 – Kezdő fejlesztő<br />🔹 Tudok űrlapokat kezelni és adatokat küldeni PHP-n keresztül.<br />🔹 Ismerem az alapvető hibakeresési módszereket (var_dump, error_reporting).<br />🔹 Tudok egyszerű adatbázis-műveleteket végezni MySQL-lel és mysqli vagy PDO használatával.<br />🔹 Képes vagyok sessionök és cookie-k kezelésére.<br />🔹 Alapszinten értem az objektumorientált programozás (OOP) működését PHP-ban.</p><p>Lvl. 3 – Középhaladó fejlesztő<br />🔹 Magabiztosan használom az OOP alapelveit (osztályok, öröklődés, interfészek, absztrakt osztályok).<br />🔹 Tudok RESTful API-kat készíteni és használni PHP segítségével.<br />🔹 Ismerem a PHP modern funkcióit (pl. strict_types, type hinting, anonymous functions).<br />🔹 Tudok biztonságos adatbáziskezelést végezni (SQL injection elleni védelem, prepared statement-ek).<br />🔹 Használok PHP csomagkezelőt (Composer) és alapvető külső csomagokat beépítek a projektekbe.<br />🔹 Alapszinten ismerem a Laravel vagy más PHP frameworkök működését.</p><p>Lvl. 4 – Haladó fejlesztő<br />🔹 Mélyebb ismereteim vannak a PHP fejlett OOP lehetőségeiről (trait-ek, dependency injection, SOLID elvek).<br />🔹 Magabiztosan használok egy vagy több PHP frameworköt (Laravel, Symfony, CodeIgniter, stb.).<br />🔹 Tudok skálázható és jól strukturált alkalmazásokat építeni.<br />🔹 Képes vagyok PHP teljesítményoptimalizálásra (OPcache, memóriahasználat optimalizálás, query optimalizáció).<br />🔹 Ismerem a modern PHP fejlesztési eszközöket (PSR szabványok, PHPUnit, Docker, CI/CD).<br />🔹 Tudok biztonságos autentikációs és jogosultsági rendszereket építeni (OAuth, JWT, Laravel Sanctum/Passport).</p><p>Lvl. 5 – Profi fejlesztő<br />🔹 Mélyrehatóan ismerem a PHP működését (memory management, garbage collection, performance tuning).<br />🔹 Képes vagyok saját csomagokat fejleszteni és publikálni Composer-en keresztül.<br />🔹 Tapasztalatom van nagy teljesítményű és skálázható PHP alkalmazások fejlesztésében (pl. mikroservicék, event-driven architektúra).<br />🔹 Tudok komplex üzleti logikákat és architektúrákat tervezni nagy rendszerekhez.<br />🔹 Aktívan követem a PHP fejlesztéseit és esetlegesen hozzájárulok nyílt forráskódú projektekhez.<br />🔹 Képes vagyok teljes rendszerintegrációkat és DevOps-folyamatokat kezelni PHP környezetben.</p>"
            } 
        }
]
